{
  "entries": [
    {
      "date": "2019-10-16",
      "title": "Week Three Beginning",
      "contents": "This has been the hardest week of NSS so far. We have gone beyond the prework, and therefore beyond my comfort zone. I'd be lying if I said I wasn't in tears a few days ago. I was feeling overwhelmed and behind. I remembered the words of John Wark, and became so grateful that they spend a few hours the first day giving us a pep talk. It made me feel better about the future, and was a good reminder to trust the process. However, it didn't make me feel less uncomfortable with the situation.",
      "mood": "discouraged",
      "id": 1
    },
    {
      "date": "2019-10-17",
      "title": "Week Three Lab Day",
      "contents": "What a difference a lab day can make! Every single person I've talked to said they've felt the same way as me--overwhelmed and behind. It's such a nice surprise to discover we're all in the exact same boat. This lab day was perfect timting. My spirits brightened, and I worked hard to complete all the exercises and get caught up. What a difference ONE DAY makes, indeed!",
      "mood": "productive",
      "id": 2
    },
    {
      "date": "2019-10-18",
      "title": "Fri-YAY",
      "contents": "It's Friday! I have survived another week of NSS. Where on earth did the time go?? Today, I want to talk about my amazing cohort. The camaraderie is awesome. I love everyone in this cohort, and every single person adds value to our collective experience. Already, we have inside jokes (tacos and castles), and even our own memes. It doesn't matter who I eat lunch with. I laugh with these people, eat with these people, walk with these people, and study with these people. In other words, I share with these people. We share thoughts, laughs, and this crazy experience that is NSS. I can only hope that wherever I land in my job, the team has a culture a sliver as good as NSS Cohort 36.",
      "mood": "optimistic",
      "id": 3
    },
    {
      "date": "2019-10-25",
      "title": "Looking Back",
      "contents": "We just finished our Welcom to Nashville project, which was a mixed bag for me. I saw some deficiencies in my communication skills. While I am a good listener, helpful, a team player, and am compassionate and kind, I am not very direct. In a difficult group situation, I could have been more brave and been a better leader. I need to work on being brave, direct, and honest. But now that that's finished, onward...",
      "mood": "discouraged",
      "id": 4
    },
    {
      "date": "2019-10-28",
      "title": "Looking Forward",
      "contents": "A new week, a new book, new chapters,new opportunities to get my mind blown by new concepts! But that is the norm here, right? We talked about array methods. It feels good to start this week fresh.",
      "mood": "optimistic",
      "id": 5
    },
    {
      "date": "2019-10-31",
      "title": "JournalJournalJournalJournalJournal",
      "contents": "We are neck deep in the journals this week. Plus side:  we've had a lot of lab time. Minus side: if I have to hear the word journal one more time...",
      "mood": "confident",
      "id": 6
    },
    {
      "date": "2019-10-31",
      "title": "EDIT",
      "contents": "Steve blew our minds with EDIT this afternoon. Still working on filtering journal results with radio buttons.",
      "mood": "nervous",
      "id": 7
    },
    {
      "date": "2019-10-31",
      "title": "Journal 8, or, the chapter that almost broke me",
      "contents": "Today was my lowest moment yet. I spent the morning crying off and on because I just. Couldn't. Get it. Every step of the way was me wrestling with something, having to fight so hard to get anything to work. I felt bruised and battered by lunch. I stepped away to take a walk, and considered quitting for the first time. I felt like I needed to apologize to my family for wasting their time and money. I thought of my children's college savings funds, languishing during this time. That was the lowest of the low moments. \n\nI couldn't go inside the school to face anyone, so I ate lunch in my car. But somehow, after listening to Fresh Air a little bit, I got it together enough to go into the building. That was a small victory in itself. \n\nAfter that, I started working again. Working, and failing. Coding, and breaking. Working, and question asking. Just looking at the directions. Considering what might be wrong. Just doing the work. \n\nAnd eventually, with the help of the instructors and my classmate Sophia, I got it. \n\nI finally got it. \n\nI felt broken that evening. Drained. But I knew the next day would be better. And it was.\n\nOn Saturday, I completed the delete feature. \n\nOn Sunday, I completed the majority of the edit feature. Edit--the one that scared me the most and was supposed to be the hardest. After some Instagram procrastination, I did it in 45 minutes.\n\nI did it.\n\nDo the work. Don't give up. And you will get it. ",
      "mood": "confident",
      "id": 8
    },
    {
      "date": "2019-11-03",
      "title": "Journal 9 and 10--Delete and Edit",
      "contents": "I worked for about 2.5 hours this weekend on Edit and Delete.  I only worked for about an hour Saturday and 45 minutes Sunday, but I got so much done in this time. It was nice to step away Friday evening and spend glorious time with family outside. Getting edit and delete to work was wonderful. I went to bed a bit early Sunday night to start the week with some good sleep. ",
      "mood": "confident",
      "id": 9
    },
    {
      "date": "2019-11-04",
      "title": "WHAT",
      "contents": "HELLO HI HOW ARE YA",
      "mood": "confident",
      "id": 15
    },
    {
      "date": "2019-11-04",
      "title": "WHAT",
      "contents": "HELLO HI HOW ARE YA",
      "mood": "confident",
      "id": 16
    },
    {
      "date": "2019-11-04",
      "title": "WHAT'S GOING ON",
      "contents": "I DONT KNOW",
      "mood": "confident",
      "id": 17
    },
    {
      "date": "2019-11-04",
      "title": "WHAT'S GOING ON",
      "contents": "I DONT KNOW",
      "mood": "confident",
      "id": 18
    },
    {
      "date": "2019-11-04",
      "title": "WHAT'S GOING ON",
      "contents": "I DONT KNOW",
      "mood": "confident",
      "id": 19
    },
    {
      "date": "2019-11-04",
      "title": "WHAT",
      "contents": "WHAT",
      "mood": "confident",
      "id": 20
    },
    {
      "date": "2019-11-04",
      "title": "WILL THIS WORK",
      "contents": "I DONT KNOW",
      "mood": "confident",
      "id": 21
    }
  ]
}